InformationRegisters/СвойстваДолжностейМедицинскихРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СвойстваДолжностейМедицинскихРаботников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЯвляетсяМедицинскойДолжностью</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/МедицинскиеРегистрыФормы/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс  

Процедура УстановитьПараметрыВыбора(Форма, ИмяЭлементаУправления, КодКлассификатора) Экспорт
	КлассификаторФРМР = Справочники.КлассификаторыФедеральныхМедрегистров.НайтиПоКоду(КодКлассификатора);
	Если ЗначениеЗаполнено(КлассификаторФРМР) Тогда
		ПараметрВыбора = Новый ПараметрВыбора("Отбор.Владелец", КлассификаторФРМР);
		Форма.Элементы[ИмяЭлементаУправления].ПараметрыВыбора = 
			Новый ФиксированныйМассив(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрВыбора));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МедицинскиеДолжности() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвойстваДолжностейМедицинскихРаботников.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.СвойстваДолжностейМедицинскихРаботников КАК СвойстваДолжностейМедицинскихРаботников
		|ГДЕ
		|	СвойстваДолжностейМедицинскихРаботников.ЯвляетсяМедицинскойДолжностью";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Должность");
	
КонецФункции 

#КонецОбласти
